In [1]:
from config_bdd import DataBaseV2
import sqlalchemy as db

database = DataBaseV2(
    db_type='postgresql',
    #db_name=dbname,
    #db_host=host,
    #db_port=port,
    #db_user=user,
    #db_password=password
    db_url="your_url"
)

# Creation d'une table et test

In [9]:
# Création d'un Tableau1
database.create_table('test', 
                      date_pred=db.DATE, 
                      type_de_bien=db.String, 
                      departement=db.String,
                      commune=db.String)

Table : 'test' are created succesfully

In [2]:
database.get_columns_table("kpis")

[{'name': 'date_pred',
  'type': DATE(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'type_de_bien',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'region',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'departement',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'commune',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None}]

In [3]:
database.add_column("kpis", "user", "VARCHAR(50)")

Colonne créée avec succès.

In [4]:
database.add_column("kpis", "pred", "FLOAT")

Colonne créée avec succès.

In [5]:
database.get_columns_table("kpis")

[{'name': 'date_pred',
  'type': DATE(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'type_de_bien',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'region',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'departement',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'commune',
  'type': VARCHAR(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'user',
  'type': VARCHAR(length=50),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'pred',
  'type': DOUBLE_PRECISION(precision=53),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None}]

In [7]:
df = database.query_to_dataframe("SELECT * FROM kpis WHERE date_pred='2024-03-05'")
df.head(10)

    date_pred type_de_bien     region departement  commune  user  pred
0  2024-03-05  Appartement  Normandie      Manche  Agneaux  None  None

In [9]:
from datetime import date

database.add_row("kpis", date_pred=date.today(),
                    type_de_bien="Maison",
                    region="Normandie",
                    departement="Manche",
                    commune="Agneaux",
                    user="test",
                    pred=125000)

Row id added

In [10]:
df = database.query_to_dataframe("SELECT * FROM kpis WHERE date_pred='2024-03-05'")
df.head(10)

    date_pred type_de_bien     region departement  commune  user      pred
0  2024-03-05  Appartement  Normandie      Manche  Agneaux  None       NaN
1  2024-03-05       Maison  Normandie      Manche  Agneaux  test  125000.0

In [18]:
import streamlit as st
from datetime import date

type_de_bien="Maison"
region="Normandie"
departement="Manche"
commune="Agneaux"
username="test2"
pred=175000
database.add_row("kpis", date_pred=date.today(),
                    type_de_bien=f"{type_de_bien}",
                    region=f"{region}",
                    departement=f"{departement}",
                    commune=f"{commune}",
                    user=f"{username}",
                    pred=float(pred))

Row id added

## Ajouts des autres paramètres.

In [3]:
database.add_column("kpis", "surface_bati", "FLOAT")

Colonne créée avec succès.

In [4]:
database.add_column("kpis", "surface_terrain", "FLOAT")

Colonne créée avec succès.

In [5]:
database.add_column("kpis", "nb_piece", "INTEGER")

Colonne créée avec succès.

In [6]:
df = database.query_to_dataframe("SELECT * FROM kpis WHERE date_pred='2024-03-05'")
df.head(10)

,date_pred,type_de_bien,region,departement,commune,user,pred,surface_bati,surface_terrain,nb_piece
0,2024-03-05,Appartement,Normandie,Manche,Agneaux,None,NaN,None,None,None
1,2024-03-05,Maison,Normandie,Manche,Agneaux,test,125000.0,None,None,None
2,2024-03-05,Maison,Normandie,Manche,Agneaux,test2,175000.0,None,None,None
3,2024-03-05,Appartement,Normandie,Manche,Agneaux,kevin3,108224.0,None,None,None

In [7]:
df = database.query_to_dataframe("SELECT * FROM kpis WHERE date_pred='2024-03-05'")
df.head(10)

,date_pred,type_de_bien,region,departement,commune,user,pred,surface_bati,surface_terrain,nb_piece
0,2024-03-05,Appartement,Normandie,Manche,Agneaux,None,NaN,NaN,NaN,NaN
1,2024-03-05,Maison,Normandie,Manche,Agneaux,test,125000.0,NaN,NaN,NaN
2,2024-03-05,Maison,Normandie,Manche,Agneaux,test2,175000.0,NaN,NaN,NaN
3,2024-03-05,Appartement,Normandie,Manche,Agneaux,kevin3,108224.0,NaN,NaN,NaN
4,2024-03-05,Appartement,Normandie,Manche,Agneaux,kevin3,199815.0,150.0,0.0,4.0

# Ajout d'une table pour alerter lors d'un dysfonctionnement de l'application
#### La table aura deux colonnes : une avec la date et l'heure l'autre sera un entier qui sera égale à 0 quand une prédiction et réalisé et 1 lors d'une erreur dans l'application.
#### Pour déclencher l'alarme, la requête sur grafana sera triée par ordre de la date et l'heure la plus récente et si la valeur dans la colonne du status est 1 alors un message sera envoyé.

In [22]:
database.delete_table("app_status")

Table app_status deleted successfully

In [23]:
# Création d'un Tableau1
database.create_table('app_status', 
                      date_status=db.TIMESTAMP,
                      status=db.Integer)

Table : 'app_status' are created succesfully

In [24]:
from datetime import datetime
database.add_row("app_status", 
                date_status=datetime.now(),
                status=1)

Row id added

In [25]:
df = database.query_to_dataframe("SELECT * FROM app_status")
df.head()

                 date_status  status
0 2024-03-08 16:13:12.013238       1

In [27]:
database.add_row("app_status", 
                date_status=datetime.now(),
                status=0)

Row id added

In [38]:
df = database.query_to_dataframe("SELECT * FROM app_status ORDER BY date_status DESC")
df.head()

                 date_status  status
0 2024-03-08 16:28:59.409620       0
1 2024-03-08 16:25:41.551689       1
2 2024-03-08 16:14:31.139184       1
3 2024-03-08 16:13:36.136284       0
4 2024-03-08 16:13:21.857678       2

In [36]:
df = database.query_to_dataframe("""
SELECT STATUS FROM app_status
ORDER BY date_status DESC
LIMIT 1""")
df.head()

   status
0       0

In [31]:
database.add_row("app_status", 
                date_status=datetime.now(),
                status=0)

Row id added